app/views/comments/_comment.html.erb

INSERT INTO "comments" ("user_id", "product_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["product_id", 2], ["content", "oklfkef"], ["created_at", "2020-07-29 10:39:13.880190"], ["updated_at", "2020-07-29 10:39:13.880190"]]
---
      <h5 class="mb-1"><%= link_to user_path(comment.user) do %><%= comment.user.name %><% end %></h5>
     <small><%= comment.created_at.strftime("%m月%d日 %H時%M分") %></small>