app/views/users/management.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
     <% purchaced_data(current_user).each do |datum| %>
     <% production = Production.find(datum.production_id) %>
     <% user = User.find(datum.user_id) %>