app/controllers/baskets_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_valiable
         @product = Product.find(params[:product_id])

INSERT INTO "baskets" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["product_id", 2], ["created_at", "2020-07-23 14:44:03.572183"], ["updated_at", "2020-07-23 14:44:03.572183"]]
---
    def create
        user = @product.store.user
        @basket = current_user.baskets.build(product_id: @product.id, count: @count) and @basket.save

SELECT  "baskets".* FROM "baskets" WHERE "baskets"."user_id" = ? AND "baskets"."product_id" = ? LIMIT ?  [["user_id", 3], ["product_id", 2], ["LIMIT", 1]]
DELETE FROM "baskets" WHERE "baskets"."id" = ?  [["id", 710]]
---
    def destroy
        @basket = current_user.baskets.find_by(product_id: @product.id)
        @basket.destroy

SELECT  "baskets".* FROM "baskets" WHERE "baskets"."user_id" = ? AND "baskets"."product_id" = ? LIMIT ?  [["user_id", 33], ["product_id", 2], ["LIMIT", 1]]
DELETE FROM "baskets" WHERE "baskets"."id" = ?  [["id", 713]]
---
    def delete
        @basket = Basket.find_by(user_id: current_user.id, product_id: params[:format])
        @basket.destroy