app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY "comments"."created_at" DESC  [["product_id", 2]]
INSERT INTO "comments" ("user_id", "product_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["product_id", 2], ["content", "oklfkef"], ["created_at", "2020-07-29 10:39:13.880190"], ["updated_at", "2020-07-29 10:39:13.880190"]]
---
  def create
    @product = Product.find(params[:comment][:id])
    @comments = @product.comments.order(created_at: "DESC")
    @comment = current_user.comments.build(product_id: @product.id,content: params[:comment][:content])
    @comment.save