app/controllers/notifications_controller.rb

  def index
    @notifications = current_user.passive_notifications.paginate(page: params[:page], per_page: 10)
    @notifications.where(checked: false).each do |notification|
      notification.update(checked: true)
---
SELECT "notifications".* FROM "notifications" ORDER BY "notifications"."created_at" DESC
UPDATE "notifications" SET "checked" = ?, "updated_at" = ? WHERE "notifications"."id" = ?  [["checked", "t"], ["updated_at", "2020-07-26 09:46:26.830649"], ["id", 648]]