app/controllers/products_controller.rb

  def create
     @store = current_user.store
     @product = @store.products.build(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "category", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "fnkk"], ["description", "fkak"], ["price", 111], ["category", "\"生活\""], ["store_id", 1], ["created_at", "2020-07-30 01:12:57.750139"], ["updated_at", "2020-07-30 01:12:57.750139"]]

  def index
    @products = Product.paginate(page: params[:page], per_page: 8)
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def line_up
    if params[:line_up] == "価格が安い"
      @products = Product.order(price: "ASC").paginate(page: params[:page], per_page: 8)
---
SELECT  "products".* FROM "products" ORDER BY "products"."price" ASC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def show
    @comment = Comment.new
    @comments = @product.comments.order(created_at: "DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY "comments"."created_at" DESC  [["product_id", 1]]

  def update
    flash[:error_messages] = @product.errors.full_messages unless  @product.update(product_params)
---
UPDATE "products" SET "category" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category", "生活"], ["updated_at", "2020-07-26 23:43:51.588375"], ["id", 7]]