app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example@railstutorial.org"], ["LIMIT", 1]]
---
  def create
    unless current_user
      user = User.find_by(email: params[:session][:email])

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def guest_login
    user = User.first

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "users"
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "address", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def guest_user_login
    unless User.any?
      user = User.create(name: "user1", email:"user1@user.com", password: "password",admin: true, seller: true)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 33]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
  def destroy
    session[:user_id] = nil
    if session[:guest_id]
      User.find(session[:guest_id]).destroy