app/controllers/stores_controller.rb

INSERT INTO "stores" ("name", "category", "user_id", "created_at", "updated_at", "description", "address", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
   if current_user.store
      redirect_to root_path
      flash[:danger] = "既にStoreを所持しています"
   else

    @store = current_user.build_store(store_params)
    @store.address ||= "東京"

    if @store.save

UPDATE "stores" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["address", "水戸市1-1"], ["latitude", 36.3787003], ["longitude", 140.4785373], ["updated_at", "2020-07-30 07:19:11.554587"], ["id", 1]]
---
  def update
    @store.update(store_params)