app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", "東京"], ["latitude", 35.6803997], ["longitude", 139.7690174], ["updated_at", "2020-07-26 13:09:59.124779"], ["id", 3]]