app/views/layouts/_side_bar.html.erb

                  <%= link_to "買い物かご　", baskets_path %>
                  <span class="badge badge-primary badge-pill"><%= current_user.baskets.count %></span><br /><br />
---
SELECT COUNT(*) FROM "baskets" WHERE "baskets"."user_id" = ?  [["user_id", 3]]